{

    "Ultima media": {
        "posts": [
            "Développeur desktop (Stage)"
        ],
        "date": "décembre 2024 - février 2020",
        "description": [
            {
                "title": "Développement desktop",
                "description": "Développement d’un logiciel desktop pour la gestion du parc informatique de l’entreprise (inventaire du matériel, suivi des maintenances, gestion des affectations)."
            },
            {
                "title": "Gestion de base de données",
                "description": "Conception et gestion de la base de données HFSQL."
            }
        ],
        "technologies": [
            "WINDEV",
            "HFSQL"
        ]
    },
    "Ingenosya": {
        "posts": [
            "Développeur Frontend",
            "Développeur Angular (Stage)"
        ],
        "date": "Avril 2021 - Mai 2022",
        "description": [
            {
                "title": "Développement Frontend",
                "description": "Responsable du développement et de la maintenance de la partie frontend des projets clients, en garantissant une expérience utilisateur fluide. J'ai collaboré avec l'équipe backend pour concevoir et implémenter des API, assurant une récupération et une manipulation efficaces des données. J'ai également aidé les nouveaux stagiaires à s'intégrer dans l'équipe en fournissant un accompagnement technique et un soutien à l'intégration."
            },
            {
                "title": "Développement Backend",
                "description": "J'ai souvent aidé l'équipe backend à développer des API en garantissant une récupération et une manipulation efficaces des données pour les applications web. J'ai aussi rédigé des requêtes SQL et des scripts pour automatiser les tâches répétitives, améliorant ainsi la performance et la fiabilité des bases de données."
            },
            {
                "title": "Version control",
                "description": "Utilisation de Git pour le contrôle de version, permettant une collaboration efficace et une gestion du code au sein des équipes de développement. Je maîtrise les branches, les merges et la résolution des conflits pour maintenir une base de code propre et organisée."
            }
        ],
        "technologies": [
            "Angular",
            "Javascript",
            "TypeScript",
            "HTML",
            "CSS",
            "SCSS",
            "Angular Material",
            "Git",
            "GitHub",
            "CodeIgniter",
            "PostgreSQL"
        ]
    },

    "Relia consulting": {
        "posts": [
            "Lead developer",
            "Développeur Fullstack",
            "Développeur Frontend"
        ],
        "date": "Mai 2022 - Septembre 2024",
        "description": [
            {
                "title": "Développement Fullstack",
                "description": "Collaboration avec des équipes interfonctionnelles pour développer et maintenir les projets clients, notamment pour les applications web et mobiles. Mon rôle inclut la création d'interfaces utilisateur dynamiques côté frontend et le développement de services backend sécurisés et évolutifs pour soutenir la logique des applications, la gestion des données et les intégrations d'API."
            },
            {
                "title": "Gestion des bases de données",
                "description": "Conception et gestion des bases de données avec l'équipe backend et le chef d'équipe."
            },
            {
                "title": "Développement d'API",
                "description": "Développement et intégration d'APIs RESTful, mise en œuvre d'une authentification sécurisée et gestion efficace des données pour soutenir la communication fluide entre le frontend et le backend."
            },
            {
                "title": "Version control",
                "description": "Utilisation de Git pour le contrôle de version, permettant une collaboration efficace et une gestion du code au sein des équipes de développement. Je maîtrise les branches, les fusions et la résolution des conflits pour maintenir une base de code propre et organisée."
            },
            {
                "title": "Team leading",
                "description": "Responsable de la gestion d'une équipe de stagiaires, partage de connaissances et accompagnement tout au long du développement d'un projet interne et d'un projet client."
            }
        ],
        "technologies": [
            "Angular",
            "Angular Material",
            "React",
            "Next.js",
            "React Native",
            "Javascript",
            "TypeScript",
            "HTML",
            "CSS",
            "SCSS",
            "Git",
            "GitLab",
            "Laravel",
            "Alpine.js",
            "Spring boot",
            "Mysql",
            "PostgreSQL",
            "MongoDB"
        ]
    }
}